---
kind: property
id: P:Autodesk.Revit.UI.ProjectBrowserOptions.ShowViewPlacementOnSheetStatusIcons
source: html/0591509c-0ab6-9164-27e1-297852c4a6da.htm
---
# Autodesk.Revit.UI.ProjectBrowserOptions.ShowViewPlacementOnSheetStatusIcons Property

Show the icons indicating view placement on sheet status.

## Syntax (C#)
```csharp
public bool ShowViewPlacementOnSheetStatusIcons { get; set; }
```

## Remarks
If true, the icons indicating view placement on sheet status will be shown at every view or schedule node in the Project Browser.
 If false, the icons indicating view placement on sheet status will not be shown.